namespace HomeWork2.Models.Data
{
    public static class DbInitializer
    {
        public static void Initialize(ApplicationContext context)
        {
            context.Database.EnsureCreated();

            if (context.Movies.Any())
            {
                return;
            }

            var movies = new Movie[]
            {
                new Movie
                {
                    Title = "\"Хрещений батько\" (The Godfather)",
                    Director = "Френсіс Форд Коппола",
                    Genre = "драма, кримінал",
                    Year = 1972,
                    PosterUrl = "/images/TheGodfather.jpg",
                    Rating = "IMDb: 9.2",
                    Description = "Рейтинг IMDb: 9.2\r\nХрещений батько - епічна мафіозна драма, яка стала культовою у світі кінематографа." +
                    " Режисером фільму є Френсіс Форд Коппола, а в основі сюжету лежить однойменний роман Маріо П'юзо \"Хрещений батько\"." +
                    " Фільм розповідає про мафіозну сім'ю Корлеоне, яка керує злочинним підпіллям Нью-Йорка. Головну роль у фільмі виконав" +
                    " Марлон Брандо, який зіграв мафіозі Дона Корлеоне.\r\n\r\nКінострічка отримала безліч нагород та визнання критиків," +
                    " ставши одним з найкращих фільмів усіх часів. Крім того, після успіху фільму було знято продовження. Друга частина" +
                    " вийшла в прокат уже в 1974 році та має теж високий рейтинг IMDb – 9.0, однак третя частина вже не отримала такого" +
                    " високого визнання глядачів.",
                },
                new Movie
                {
                    Title = "Список Шиндлера (Schindler's List)",
                    Director = "Стівен Спілберг",
                    Genre = "драма, історичний, біографічний",
                    Year = 1993,
                    PosterUrl = "/images/SchindlersList.jpg",
                    Rating = "IMDb: 9.0",
                    Description = "Рейтинг IMDb: 9.0\r\nСписок Шиндлера - це військово-біографічна драма режисера Стівена Спілберга, яка" +
                    " базується на однойменному романі Томаса Кініллі. Фільм розповідає історію Оскара Шиндлера, німецького підприємця," +
                    " який врятував від загибелі більше тисячі євреїв під час Голокосту, використовуючи їх як робочу силу на своїх фабриках." +
                    " \"Список Шиндлера\" отримав безліч нагород, включаючи сім \"Оскарів\", три статуетки \"Золотий глобус\" та дві \"Ґреммі\"." +
                    " Це шокуючий та емоційно важкий фільм, який розповідає історії воєнного часу та геноциду.",
                },
                new Movie
                {
                    Title = "Темний лицар (The Dark Knight)",
                    Director = "Крістофер Нолан",
                    Genre = "драма, екшн, кримінал, трилер",
                    Year = 2008,
                    PosterUrl = "/images/TheDarkKnight.jpg",
                    Rating = "IMDb: 9.0",
                    Description = "Рейтинг IMDb: 9.0\r\nТемний лицар (2008) - фільм режисера Крістофера Нолана, який став другим з трилогії" +
                    " про Бетмена. Перша частина під назвою \"Бетмен: Початок\", вийшла у 2005 році та має дещо нижчий рейтинг IMDb – 8.2," +
                    " однак для загального розуміння сюжету її варто переглянути.\r\n\r\nУ кінострічці Бетмен, виконуючи свою місію боротьби" +
                    " зі злочинністю в Готемі, зіштовхується зі своїм найвеличнішим ворогом - Джокером, якого втілює Гіт Леджер. Фільм визнаний" +
                    " критиками та глядачами за його вражаючі спецефекти, захоплюючий сюжет та неймовірну акторську гру. \" Темний лицар\"" +
                    " отримав численні нагороди та номінації, включно з \"Оскаром\".",
                },
                new Movie
                {
                    Title = "Втеча з Шоушенка (The Shawshank Redemption)",
                    Director = "Френк Дарабонт",
                    Genre = "драма, кримінал",
                    Year = 1994,
                    PosterUrl = "/images/TheShawshankRedemption.jpg",
                    Rating = "IMDb: 9.3",
                    Description = "Рейтинг IMDb: 9.3\r\nВтеча з Шоушенка - фільм режисера Френка Дарабонта, що був випущений у 1994 році." +
                    " Стрічка основана на новелі Стівена Кінга і стала класичним шедевром кінематографа. Розповідає історію Енді Дюфрейна," +
                    " який незаслужено засуджений за вбивство дружини та її коханця та відправлений до тюрми Шоушенк на пожиттєве ув'язнення." +
                    " У тюрмі Енді виявляє неймовірний характер та віру у свободу. Фільм славиться своєю захоплюючою сюжетною лінією, цікавою" +
                    " акторською грою Моргана Фрімена та Тіма Роббінса, а також своєрідною атмосферою надії та віри в людське добро.",
                },
                new Movie
                {
                    Title = "Володар перснів (The Lord of the Rings)",
                    Director = "Пітер Джексон",
                    Genre = "пригоди, драма, екшн, фентезі",
                    Year = 2001,
                    PosterUrl = "/images/LordOfTheRings.jpg",
                    Rating = "IMDb: 8.9",
                    Description = "Рейтинг IMDb: 8.9\r\nВолодар перснів - епічний фільм, заснований на романі Джона Рональда Руела Толкіна." +
                    " Трилогія здобувала велику популярність у світі, а третя частина має найкращі оцінки.\r\n\r\nУ цій частині глядачі" +
                    " знайомляться з персонажами та вступають у світ Середзем'я. Фродо Беггінс, звичайний хоббіт з Шири, спільно зі своїми" +
                    " друзями - Леголасом, Гімлі, Арагорном, Гендальфом та іншими - вирушає в епічну подорож, щоб знищити особливий перстень," +
                    " який є джерелом великої загрози для всього Середзем'я.\r\n\r\nФільм отримав високу оцінку критиків і прихильників," +
                    " заробивши ряд нагород та номінацій на престижних кінопреміях, а третя частина \"Володар перснів: Повернення короля\"" +
                    " отримала 11 премій \"Оскар\", зокрема за найкращий фільм та режисуру. Він визнаний одним з найкращих фільмів усіх часів" +
                    " та залишається улюбленою класикою серед прихильників фентезі.",
                },
                new Movie
                {
                    Title = "Кримінальне чтиво (Pulp Fiction)",
                    Director = "Квентін Тарантіно",
                    Genre = "кримінал, драма, трилер, комедія",
                    Year = 1994,
                    PosterUrl = "/images/PulpFiction.jpg",
                    Rating = "IMDb: 8.9",
                    Description = "Рейтинг IMDb: 8.9\r\nКримінальне чтиво - культовий американський фільм 1994 року, який був написаний та" +
                    " зрежисований Квентіном Тарантіно. Фільм складається з ряду переплетених історій, що відтворюють життя різних персонажів" +
                    " у злочинному світі Лос-Анджелеса.\r\n\r\nФільм \"Кримінальне чтиво\" отримав величезний успіх та визнаний критиками й" +
                    " глядачами. Він отримав багато престижних нагород, включаючи Оскар за найкращий сценарій. Кінострічка вирізняється своїм" +
                    " нестандартним сюжетним ходом, відмінними діалогами, а також непередбачуваними поворотами подій.",
                },
                new Movie
                {
                    Title = "Бійцівський клуб (Fight Club)",
                    Director = "Девід Фінчер",
                    Genre = "драма",
                    Year = 1999,
                    PosterUrl = "/images/FightClub.jpg",
                    Rating = "IMDb: 8.8",
                    Description = "Рейтинг IMDb: 8.8\r\nБійцівський клуб – фільм спільного виробництва США та Німеччини, знятий Девідом" +
                    " Фінчером та заснований на однойменному романі Чака Поланіка. Фільм став культовим та отримав широку популярність" +
                    " завдяки непередбачуваному сюжету та непересічною режисерською роботою.\r\n\r\nКінострічку часто характеризують як" +
                    " \"чорну комедію\", що розповідає про історію звичайного менеджера. Він страждає від безсоння та інших дрібних проблем," +
                    " однак згодом потрапляє у світ бійцівських клубів, де приєднується до цього жорстокого підпілля. Фільм викликав великий" +
                    " резонанс у глядачів і став одним з найвпливовіших культових фільмів 1990-х років.",
                },
                new Movie
                {
                    Title = "Форрест Ґамп (Forrest Gump)",
                    Director = "Роберт Земекіс",
                    Genre = "мелодрама, драма, трагікомедія",
                    Year = 1994,
                    PosterUrl = "/images/ForrestGump.jpg",
                    Rating = "IMDb: 8.8",
                    Description = "Рейтинг IMDb: 8.8\r\nФоррест Гамп - американський фільм, знятий Робертом Земекісом і заснований на" +
                    " однойменному романі Вінстона Грума. Фільм став одним з найуспішніших у кінематографії та отримав безліч нагород," +
                    " включно з шістьма преміями \"Оскар\".\r\n\r\nУ кінострічці головну роль виконав Том Генкс. Фільм розповідає історію" +
                    " Форреста Гампа, чоловіка з низьким рівнем інтелекту, але з великим серцем, який переживає низку неймовірних подій:" +
                    " війну у В'єтнамі, рух за права громадян та вибудовує успішну спортивну кар'єру. Фільм вирізняється не лише захоплюючим" +
                    " сюжетом, а й глибокими філософськими темами, які стосуються важливих подій та проблем сучасного суспільства. Він став" +
                    " класикою кінематографа та широко визнаним шедевром сучасної кіноіндустрії.",
                },
                new Movie
                {
                    Title = "Початок (Inception)",
                    Director = "Крістофер Нолан",
                    Genre = "пригоди, екшн, трилер, фантастика, бойовик",
                    Year = 2010,
                    PosterUrl = "/images/Inception.jpg",
                    Rating = "IMDb: 8.8",
                    Description = "Рейтинг IMDb: 8.8\r\nПочаток - фантастичний бойовик, знятий та спродюсований Крістофером Ноланом." +
                    " Фільм вийшов у 2010 році та став одним з найбільш високо оцінених у своєму десятилітті. У кінострічці головну роль" +
                    " виконує Леонардо Ді Капріо. Він грає спеціаліста з викрадення секретів, який проникає у сни людей. Цей фільм відрізняється" +
                    " вражаючими спецефектами, складним сюжетом, глибокими філософськими та етичними питаннями, що порушуються в ході розкриття" +
                    " історії.\r\n\r\n\"Початок\" отримав високу оцінку критиків та глядачів, а також багато нагород та номінацій, включно з" +
                    " чотирма статуетками \"Оскар\". Фільм визнаний класикою жанру науково-фантастичного кіно та залишається одним з найбільш" +
                    " впливових у світі кінематографа.",
                },
            };

            foreach (Movie m in movies)
            {
                context.Movies.Add(m);
            }
            context.SaveChanges();
        }
    }
}
